mooc-ui/SDK15.3-test-in-NRF52840-/examples/ble_peripheral/ble_app_hrs/main.c
	ble_log_t *p_log = &m_log;
    //NRF_LOG_INFO("is_notify_enabled = %d is_indicate_enabled = %d....",p_log->is_notify_enabled,p_log->is_indicate_enabled);
    if ((p_log->conn_handle != BLE_CONN_HANDLE_INVALID)      
		&& (p_log->is_notify_enabled == true)) {  
		uint16_t               hvx_len;
		ble_gatts_hvx_params_t hvx_params;
		hvx_len = len;
		
		memset(&hvx_params, 0, sizeof(hvx_params));

        hvx_params.handle = p_log->ctrl_handles.value_handle;
		hvx_params.type   = BLE_GATT_HVX_NOTIFICATION;//如果是indicate 则用BLE_GATT_HVX_INDICATION
		hvx_params.offset = 0;
		hvx_params.p_len  = &hvx_len;
		hvx_params.p_data = msg;
		err_code = sd_ble_gatts_hvx(p_log->conn_handle, &hvx_params);
        NRF_LOG_INFO("notify sd_ble_gatts_hvx err_code = %x",err_code);
		if ((err_code == NRF_SUCCESS) && (hvx_len != len)) {
			err_code = NRF_ERROR_DATA_SIZE;
		}
	}else {
		err_code = NRF_ERROR_INVALID_STATE;
	}

	return err_code;
}

uint32_t eeg_indicate(uint8_t* msg, uint16_t len){
	uint32_t err_code;
	ble_log_t *p_log = &m_log;
    if ((p_log->conn_handle != BLE_CONN_HANDLE_INVALID)      
		&& (p_log->is_indicate_enabled == true)) {  
		uint16_t               hvx_len;
		ble_gatts_hvx_params_t hvx_params;
		hvx_len = len;
		
		memset(&hvx_params, 0, sizeof(hvx_params));
            
        //NRF_LOG_INFO("start indicate  p_log->is_indicate_enabled = %d p_eeg->is_notify_enabled = %d",p_log->is_indicate_enabled, p_log->is_notify_enabled);
        
        //如果这个地方选错了通道就会出现BLE_ERROR_GATTS_SYS_ATTR_MISSING (err_code = 0x3401)
        hvx_params.handle = p_log->data_handles.value_handle;// ctrl_handles.value_handle;
            
		hvx_params.type   = BLE_GATT_HVX_INDICATION;//如果是indicate 则用BLE_GATT_HVX_INDICATION
		hvx_params.offset = 0;
		hvx_params.p_len  = &hvx_len;
		hvx_params.p_data = msg;
		err_code = sd_ble_gatts_hvx(p_log->conn_handle, &hvx_params);//indicate or notify data
        //返回BLE_ERROR_GATTS_SYS_ATTR_MISSING
//        NRF_LOG_INFO("indicate sd_ble_gatts_hvx err_code = %x",err_code);
//		if ((err_code == NRF_SUCCESS) && (hvx_len != len)) {
//			err_code = NRF_ERROR_DATA_SIZE;
//		}    
	}else {
        //NRF_LOG_INFO("indicate sd_ble_gatts_hvx err_code = %x",err_code);
		err_code = NRF_ERROR_INVALID_STATE;
	}

	return err_code;
}


/**@brief Function for initializing services that will be used by the application.
 *
 * @details Initialize the Heart Rate, Battery and Device Information services.
 */
static void services_init(void)
{
    ret_code_t         err_code;
    ble_hrs_init_t     hrs_init;
    ble_bas_init_t     bas_init;
    ble_dis_init_t     dis_init;
    ble_log_init_t     log_init;
    nrf_ble_qwr_init_t qwr_init = {0};
    uint8_t            body_sensor_location;

    // Initialize Queued Write Module.
    qwr_init.error_handler = nrf_qwr_error_handler;

    err_code = nrf_ble_qwr_init(&m_qwr, &qwr_init);
    APP_ERROR_CHECK(err_code);

    // Initialize Heart Rate Service.
//    body_sensor_location = BLE_HRS_BODY_SENSOR_LOCATION_FINGER;

//    memset(&hrs_init, 0, sizeof(hrs_init));

//    hrs_init.evt_handler                 = NULL;
//    hrs_init.is_sensor_contact_supported = true;
//    hrs_init.p_body_sensor_location      = &body_sensor_location;

    // Here the sec level for the Heart Rate Service can be changed/increased.
//    hrs_init.hrm_cccd_wr_sec = SEC_OPEN;
//    hrs_init.bsl_rd_sec      = SEC_OPEN;

//    err_code = ble_hrs_init(&m_hrs, &hrs_init);
//    APP_ERROR_CHECK(err_code);

    // Initialize Battery Service.
//    memset(&bas_init, 0, sizeof(bas_init));

//    bas_init.evt_handler          = NULL;
//    bas_init.support_notification = true;
//    bas_init.p_report_ref         = NULL;
//    bas_init.initial_batt_level   = 100;

    // Here the sec level for the Battery Service can be changed/increased.
    bas_init.bl_rd_sec        = SEC_OPEN;
    bas_init.bl_cccd_wr_sec   = SEC_OPEN;
    bas_init.bl_report_rd_sec = SEC_OPEN;

    err_code = ble_bas_init(&m_bas, &bas_init);
    APP_ERROR_CHECK(err_code);

    // Initialize Device Information Service.
    memset(&dis_init, 0, sizeof(dis_init));

    ble_srv_ascii_to_utf8(&dis_init.manufact_name_str, (char *)MANUFACTURER_NAME);

    dis_init.dis_char_rd_sec = SEC_OPEN;

    err_code = ble_dis_init(&dis_init);
    APP_ERROR_CHECK(err_code);
    
    //log service init
    memset(&log_init, 0, sizeof(log_init));
    err_code = ble_log_init(&m_log, &log_init);
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for initializing the sensor simulators.
 */
static void sensor_simulator_init(void)
{
    m_battery_sim_cfg.min          = MIN_BATTERY_LEVEL;
    m_battery_sim_cfg.max          = MAX_BATTERY_LEVEL;
    m_battery_sim_cfg.incr         = BATTERY_LEVEL_INCREMENT;
    m_battery_sim_cfg.start_at_max = true;

    sensorsim_init(&m_battery_sim_state, &m_battery_sim_cfg);

    m_heart_rate_sim_cfg.min          = MIN_HEART_RATE;
    m_heart_rate_sim_cfg.max          = MAX_HEART_RATE;
    m_heart_rate_sim_cfg.incr         = HEART_RATE_INCREMENT;
    m_heart_rate_sim_cfg.start_at_max = false;

    sensorsim_init(&m_heart_rate_sim_state, &m_heart_rate_sim_cfg);

    m_rr_interval_sim_cfg.min          = MIN_RR_INTERVAL;
    m_rr_interval_sim_cfg.max          = MAX_RR_INTERVAL;
    m_rr_interval_sim_cfg.incr         = RR_INTERVAL_INCREMENT;
    m_rr_interval_sim_cfg.start_at_max = false;

    sensorsim_init(&m_rr_interval_sim_state, &m_rr_interval_sim_cfg);
}


/**@brief Function for starting application timers.
 */
static void application_timers_start(void)
{
    ret_code_t err_code;

    // Start application timers.
    err_code = app_timer_start(m_battery_timer_id, BATTERY_LEVEL_MEAS_INTERVAL, NULL);
    APP_ERROR_CHECK(err_code);

    err_code = app_timer_start(m_heart_rate_timer_id, HEART_RATE_MEAS_INTERVAL, NULL);
    APP_ERROR_CHECK(err_code);

    err_code = app_timer_start(m_rr_interval_timer_id, RR_INTERVAL_INTERVAL, NULL);
    APP_ERROR_CHECK(err_code);

    err_code = app_timer_start(m_sensor_contact_timer_id, SENSOR_CONTACT_DETECTED_INTERVAL, NULL);
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for handling the Connection Parameters Module.
 *
 * @details This function will be called for all events in the Connection Parameters Module which
 *          are passed to the application.
 *          @note All this function does is to disconnect. This could have been done by simply
 *                setting the disconnect_on_fail config parameter, but instead we use the event
 *                handler mechanism to demonstrate its use.
 *
 * @param[in] p_evt  Event received from the Connection Parameters Module.
 */
static void on_conn_params_evt(ble_conn_params_evt_t * p_evt)
{
    ret_code_t err_code;

