mooc-ui/SDK15.3-test-in-NRF52840-/examples/ble_peripheral/ble_app_hrs/main.c
    switch (event)
    {
        case BSP_EVENT_SLEEP:
            sleep_mode_enter();
            break;

        case BSP_EVENT_DISCONNECT:
            err_code = sd_ble_gap_disconnect(m_conn_handle,
                                             BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
            if (err_code != NRF_ERROR_INVALID_STATE)
            {
                APP_ERROR_CHECK(err_code);
            }
            break;

        case BSP_EVENT_WHITELIST_OFF:
            if (m_conn_handle == BLE_CONN_HANDLE_INVALID)
            {
                err_code = ble_advertising_restart_without_whitelist(&m_advertising);
                if (err_code != NRF_ERROR_INVALID_STATE)
                {
                    APP_ERROR_CHECK(err_code);
                }
            }
            break;

        default:
            break;
    }
}


/**@brief Function for the Peer Manager initialization.
 */
static void peer_manager_init(void)
{
    ble_gap_sec_params_t sec_param;
    ret_code_t           err_code;

    err_code = pm_init();
    APP_ERROR_CHECK(err_code);

    memset(&sec_param, 0, sizeof(ble_gap_sec_params_t));

    // Security parameters to be used for all security procedures.
    sec_param.bond           = SEC_PARAM_BOND;
    sec_param.mitm           = SEC_PARAM_MITM;
    sec_param.lesc           = SEC_PARAM_LESC;
    sec_param.keypress       = SEC_PARAM_KEYPRESS;
    sec_param.io_caps        = SEC_PARAM_IO_CAPABILITIES;
    sec_param.oob            = SEC_PARAM_OOB;
    sec_param.min_key_size   = SEC_PARAM_MIN_KEY_SIZE;
    sec_param.max_key_size   = SEC_PARAM_MAX_KEY_SIZE;
    sec_param.kdist_own.enc  = 1;
    sec_param.kdist_own.id   = 1;
    sec_param.kdist_peer.enc = 1;
    sec_param.kdist_peer.id  = 1;

    err_code = pm_sec_params_set(&sec_param);
    APP_ERROR_CHECK(err_code);

    err_code = pm_register(pm_evt_handler);
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for initializing the Advertising functionality.
 */
static void advertising_init(void)
{
    ret_code_t             err_code;
    ble_advertising_init_t init;

    memset(&init, 0, sizeof(init));

    init.advdata.name_type               = BLE_ADVDATA_FULL_NAME;
    init.advdata.include_appearance      = true;
    init.advdata.flags                   = BLE_GAP_ADV_FLAGS_LE_ONLY_GENERAL_DISC_MODE;
    init.advdata.uuids_complete.uuid_cnt = sizeof(m_adv_uuids) / sizeof(m_adv_uuids[0]);
    init.advdata.uuids_complete.p_uuids  = m_adv_uuids;

    init.config.ble_adv_fast_enabled  = true;
    init.config.ble_adv_fast_interval = APP_ADV_INTERVAL;
    init.config.ble_adv_fast_timeout  = APP_ADV_DURATION;

    init.evt_handler = on_adv_evt;

    err_code = ble_advertising_init(&m_advertising, &init);
    APP_ERROR_CHECK(err_code);

    ble_advertising_conn_cfg_tag_set(&m_advertising, APP_BLE_CONN_CFG_TAG);
}


/**@brief Function for initializing buttons and leds.
 *
 * @param[out] p_erase_bonds  Will be true if the clear bonding button was pressed to wake the application up.
 */
static void buttons_leds_init(bool * p_erase_bonds)
{
    ret_code_t err_code;
    bsp_event_t startup_event;

    err_code = bsp_init(BSP_INIT_LEDS | BSP_INIT_BUTTONS, bsp_event_handler);
    APP_ERROR_CHECK(err_code);

    err_code = bsp_btn_ble_init(NULL, &startup_event);
    APP_ERROR_CHECK(err_code);

    *p_erase_bonds = (startup_event == BSP_EVENT_CLEAR_BONDING_DATA);
}


/**@brief Function for initializing the nrf log module.
 */
static void log_init(void)
{
    ret_code_t err_code = NRF_LOG_INIT(NULL);
    APP_ERROR_CHECK(err_code);

    NRF_LOG_DEFAULT_BACKENDS_INIT();
}


/**@brief Function for initializing power management.
 */
static void power_management_init(void)
{
    ret_code_t err_code;
    err_code = nrf_pwr_mgmt_init();
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for handling the idle state (main loop).
 *
 * @details If there is no pending log operation, then sleep until next the next event occurs.
 */
static void idle_state_handle(void)
{
    ret_code_t err_code;

    err_code = nrf_ble_lesc_request_handler();
    APP_ERROR_CHECK(err_code);

    if (NRF_LOG_PROCESS() == false)
    {
        nrf_pwr_mgmt_run();
    }
}

static void hardware_init(void){
    /*里面应该包含各种外部硬件设备的状态
    例如电池的状态、传感器的状态、整个设备所处在状态*/
}

static void add_loop_func(uint16_t opera_id, userDefFunc udf){
    if(opera_id != 0 && udf != NULL){
        if(opera_id <= MAX_OPERA_NUM){
            lpcb[opera_id-1].event = opera_id;
            lpcb[opera_id-1].func = udf;
        }
    }
}

static void sensor1_task(void *p_context){
    NRF_LOG_INFO("I'am sensor1 process");
}

static void RadioLink_TxTask(void *p_context){//p_context是一个指针变量，指向一个任意类型的地址
    st_bleWrite_t *radio_link_data_tx = (st_bleWrite_t *)p_context;
    
    //NRF_LOG_INFO("i'am tx task tx data:%x ",radio_link_tx->len);//
    uint16_t evt = radio_link_data_tx->bleWriteOp;//*((uint16_t*)p_context);//buffer->evt;//*((uint16_t*)p_context);
    switch(evt){
        case BLE_INDICATE:
            NRF_LOG_INFO("into ble indicate TX DATA:%x tx data len = %d",radio_link_data_tx->data[0],radio_link_data_tx->len);
            //eeg_indicate(data, data_len);
            break;
        case BLE_NOTIFY:
            NRF_LOG_INFO("into ble notify TX DATA:%x tx data len = %d",radio_link_data_tx->data[0],radio_link_data_tx->len);
            NRF_LOG_INFO("into ble notify");
            //eeg_notify(data, data_len);
            break;
        case BLE_IDLE: 
            NRF_LOG_INFO("into ble idle");
            break;
        default:
            break;
    }
}

static void RadioLink_RxTask(void *p_context){
    NRF_LOG_INFO("I'am radio rx task process");
}
static void flash_read_write_task(void *p_context){
    /*
    switch(type){
        case read:
            break;
        case write:
            break;
        default:
            break;
    }
    */
}
static void sensor_data_process_task(void *p_context){
    //
}

