mooc-ui/SDK15.3-test-in-NRF52840-/examples/ble_peripheral/ble_app_hrs/main.c
static void power_management_task(void *p_context){
    //
}




static void system_task(void *p_context){
    stEvtBuffer buffer;
    st_bleWrite_t radio_link_data = {
        .bleWriteOp = BLE_IDLE,//此处的变量为staitc,初始化为idle,如果不初始化会出现异常
    };
    uint8_t data_len = 20;
    uint8_t data[20] = {0};
    memset(data,get_time()%255,20);
    eeg_notify(data, data_len);
    if(eeg_indicate(data, data_len) != NRF_SUCCESS){//indicate failed
        //resend data by indicate
    }
    //NRF_LOG_INFO("I'am system event process");
    if(get_time()%5 == 0){
        radio_link_data.bleWriteOp = BLE_NOTIFY;
        //radio_link_data.data[0] =0xAA;
        uint8_t notify_data = 0xAA;
        memcpy(radio_link_data.data, &notify_data, 20);
        radio_link_data.len = 20;
        radio_link_data.status = 1;  
        
        buffer.evt = RADIO_TX_OP;
        buffer.payload = (void *)&radio_link_data;//task的参数
        mring_queueSend(mrEvtQueue, &buffer);
    }
    if(get_time()%10 == 0){
        radio_link_data.bleWriteOp = BLE_INDICATE;
        radio_link_data.len = 20;
        radio_link_data.status = 1;
        uint8_t indicate_data =0x55;
        memcpy(radio_link_data.data, &indicate_data, 20);
        
        buffer.evt = RADIO_TX_OP;
        buffer.payload = (void *)&radio_link_data;
        mring_queueSend(mrEvtQueue, &buffer);
    }
}

static void non_system_task(void *p_context){
    //todo
    return;
}

static void task_body(void){
    add_loop_func(SENSOR_OP, sensor1_task);
    add_loop_func(RADIO_TX_OP, RadioLink_TxTask);
    add_loop_func(RADIO_RX_OP, RadioLink_RxTask);
    add_loop_func(FLASH_WRITE_READ_OP, flash_read_write_task);
    add_loop_func(SENSOR_DATA_PROCESS_OP, sensor_data_process_task);
    add_loop_func(POWER_MANAGEMENT_OP, power_management_task);
    add_loop_func(SYS_OP, system_task);
}

static void task_init(void){
    mrEvtQueue = mring_queueInit(SYS_EVT_QUEUE);//队列初始化(相当于任务初始化)
    NonEvtQueue = mring_queueInit(NON_EVT_QUEUE);
    mrAfeQueue = mring_queueInit(AFE_I2C_QUEUE);
	mrAccQueue = mring_queueInit(ACC_I2C_QUEUE);
}

static void consume_task(){
    if(NULL != mrEvtQueue) {
        while(!mring_queueIsEmpty(mrEvtQueue)) {
            stEvtBuffer buffer;
            if(true == mring_queueReceive(mrEvtQueue, (void*)&buffer)) {
                if(buffer.evt != 0) {
                    if (lpcb[buffer.evt-1].func) {
                        lpcb[buffer.evt-1].func(buffer.payload);
                    }
                } 
            }
            memset((void *)&buffer, 0, sizeof(stEvtBuffer));
            if(true == mring_queueReceive(NonEvtQueue, (void*)&buffer)){
                if(buffer.evt != 0 && lpcb[buffer.evt-1].func != NULL){
                    lpcb[buffer.evt-1].func(buffer.payload);
                }
            }
        }
    }
}

/**@brief Function for application main entry.
 */
int main(void)
{
    bool erase_bonds;
    hardware_init();
    task_init();

    // Initialize.
    log_init();
    timers_init();
    buttons_leds_init(&erase_bonds);
    power_management_init();
    ble_stack_init();
    gap_params_init();
    gatt_init();
    advertising_init();
    services_init();
    sensor_simulator_init();
    conn_params_init();
    peer_manager_init();
    
    rtc2_enable();
    task_body();

    // Start execution.
    NRF_LOG_INFO("Heart Rate Sensor example started.");
    application_timers_start();
    advertising_start(erase_bonds);
    
    // Enter main loop.
    for (;;)
    {
        consume_task();
        idle_state_handle();
    }
}


